In [2]:
# MELT

import pandas as pd

In [3]:
df = pd.DataFrame({"A": {0:"a",1:"b",2:"c"},
                   "B": {0:1,1:3,2:5},
                   "C": {0:2,1:4,2:6}})

In [4]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [7]:
m = pd.melt(df, id_vars=["A", "C"], value_vars= ["B"])

In [8]:
m

   A  C variable  value
0  a  2        B      1
1  b  4        B      3
2  c  6        B      5

In [9]:
m = pd.melt(df, id_vars=["A"], value_vars= ["B", "C"])

In [10]:
m

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [11]:
m = pd.melt(df, id_vars=["A"], value_vars= ["B", "C"], var_name="VarTeste")

In [12]:
m

   A VarTeste  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [13]:
m = pd.melt(df, id_vars=["A"], value_vars= ["B", "C"], var_name="VarTeste", value_name="ValTeste")

In [14]:
m

   A VarTeste  ValTeste
0  a        B         1
1  b        B         3
2  c        B         5
3  a        C         2
4  b        C         4
5  c        C         6

In [15]:
# PARTE 2

In [16]:
data = {
    "localização": ["CidadeA", "CidadeB"],
    "temperatura": ["Prevista", "Atual"],
    "Set-2019": [30,32],
    "Out-2019": [45,43],
    "Nov-2019": [24,22]
}
print(data)

{'localização': ['CidadeA', 'CidadeB'], 'temperatura': ['Prevista', 'Atual'], 'Set-2019': [30, 32], 'Out-2019': [45, 43], 'Nov-2019': [24, 22]}

In [17]:
df = pd.DataFrame(data, columns=["localização","temperatura","Set-2019","Out-2019","Nov-2019"])
df

  localização temperatura  Set-2019  Out-2019  Nov-2019
0     CidadeA    Prevista        30        45        24
1     CidadeB       Atual        32        43        22

In [18]:
df2 = pd.melt(df, id_vars=["localização","temperatura"], var_name="Date", value_name="Value")
df2

  localização temperatura      Date  Value
0     CidadeA    Prevista  Set-2019     30
1     CidadeB       Atual  Set-2019     32
2     CidadeA    Prevista  Out-2019     45
3     CidadeB       Atual  Out-2019     43
4     CidadeA    Prevista  Nov-2019     24
5     CidadeB       Atual  Nov-2019     22